#+title: Software Engineer Notes

* Overwiew
[[file:db/index.org][Databases]] specific topics

* Example
#+begin_src go
import "fmt"

func main() {
	for i, v := range []int{1,2,3} {
		fmt.Println(i,v)
	}
}
#+end_src

#+RESULTS:
: 0 1
: 1 2
: 2 3
